tiborsimon/embedded-tdd-headers/pic/pic18/pic18lf26j11_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18LF26J11_H_
#define _PIC18LF26J11_H_

#define PPSCON                        0
#define IOLOCK                        1
#define PADCFG1                       2
#define PMPTTL                        3
#define RTSECSEL0                     4
#define RTSECSEL1                     5
#define REFOCON                       6
#define RODIV0                        7
#define RODIV                         8
#define RODIV1                        9
#define RODIV2                        10
#define RODIV3                        11
#define ROSEL                         12
#define ROSSLP                        13
#define ROON                          14
#define RTCCAL                        15
#define CAL0                          16
#define CAL                           17
#define CAL1                          18
#define CAL2                          19
#define CAL3                          20
#define CAL4                          21
#define CAL5                          22
#define CAL6                          23
#define CAL7                          24
#define RTCCFG                        25
#define RTCPTR0                       26
#define RTCPTR1                       27
#define RTCOE                         28
#define HALFSEC                       29
#define RTCSYNC                       30
#define RTCWREN                       31
#define RTCEN                         32
#define ODCON3                        33
#define SPI1OD                        34
#define SPI2OD                        35
#define ODCON2                        36
#define U1OD                          37
#define U2OD                          38
#define ODCON1                        39
#define ECCP1OD                       40
#define ECCP2OD                       41
#define ANCON0                        42
#define PCFG0                         43
#define PCFG1                         44
#define PCFG2                         45
#define PCFG3                         46
#define PCFG4                         47
#define ANCON1                        48
#define PCFG8                         49
#define PCFG9                         50
#define PCFG10                        51
#define PCFG11                        52
#define PCFG12                        53
#define PCFG14                        54
#define VBG2EN                        55
#define PCFG15                        56
#define VBGEN                         57
#define DSWAKEL                       58
#define DSPOR                         59
#define DSMCLR                        60
#define DSRTC                         61
#define DSWDT                         62
#define DSULP                         63
#define DSFLT                         64
#define DSWAKEH                       65
#define DSINT0                        66
#define DSCONL                        67
#define RELEASE                       68
#define DSBOR                         69
#define ULPWDIS                       70
#define DSCONH                        71
#define RTCWDIS                       72
#define DSULPEN                       73
#define DSEN                          74
#define DSGPR0                        75
#define DSGPR1                        76
#define TCLKCON                       77
#define T3CCP1                        78
#define T3CCP2                        79
#define T1RUN                         80
#define CVRCON                        81
#define CVR                           82
#define CVR0                          83
#define CVR1                          84
#define CVR2                          85
#define CVR3                          86
#define CVRSS                         87
#define CVRR                          88
#define CVROEN                        89
#define CVROE                         90
#define CVREN                         91
#define DMABCH                        92
#define DMACNTHB                      93
#define DMABCL                        94
#define DMACNTLB                      95
#define RXADDRH                       96
#define DMARCPTRHB                    97
#define RXADDRL                       98
#define DMARCVPTRLB                   99
#define TXADDRH                       100
#define DMATXPTRHB                    101
#define TXADDRL                       102
#define DMATXPTRLB                    103
#define CMSTAT                        104
#define COUT1                         105
#define COUT2                         106
#define SSP2CON2                      107
#define SEN2                          108
#define SSP2CON2_SEN                  109
#define ADMSK12                       110
#define SSP2CON2_RSEN                 111
#define RSEN2                         112
#define SSP2CON2_ADMSK1               113
#define ADMSK22                       114
#define PEN2                          115
#define SSP2CON2_PEN                  116
#define SSP2CON2_ADMSK2               117
#define ADMSK32                       118
#define SSP2CON2_RCEN                 119
#define RCEN2                         120
#define SSP2CON2_ADMSK3               121
#define ACKEN2                        122
#define ADMSK42                       123
#define SSP2CON2_ADMSK4               124
#define SSP2CON2_ACKEN                125
#define ACKDT2                        126
#define ADMSK52                       127
#define SSP2CON2_ACKDT                128
#define SSP2CON2_ADMSK5               129
#define SSP2CON2_ACKSTAT              130
#define ACKSTAT2                      131
#define SSP2CON2_GCEN                 132
#define GCEN2                         133
#define SSP2CON1                      134
#define SSP2CON1_SSPM                 135
#define SSP2CON1_SSPM0                136
#define SSPM02                        137
#define SSPM12                        138
#define SSP2CON1_SSPM1                139
#define SSP2CON1_SSPM2                140
#define SSPM22                        141
#define SSPM32                        142
#define SSP2CON1_SSPM3                143
#define SSP2CON1_CKP                  144
#define CKP2                          145
#define SSPEN2                        146
#define SSP2CON1_SSPEN                147
#define SSPOV2                        148
#define SSP2CON1_SSPOV                149
#define WCOL2                         150
#define SSP2CON1_WCOL                 151
#define SSP2STAT                      152
#define SSP2STAT_BF                   153
#define BF2                           154
#define SSP2STAT_UA                   155
#define UA2                           156
#define RW2                           157
#define READ_WRITE2                   158
#define nW2                           159
#define I2C_READ2                     160
#define SSP2STAT_R_NOT_W              161
#define R_nW2                         162
#define nWRITE2                       163
#define R_W2                          164
#define SSP2STAT_R_nW                 165
#define SSP2STAT_S                    166
#define S2                            167
#define START2                        168
#define I2C_START2                    169
#define P2                            170
#define SSP2STAT_P                    171
#define STOP2                         172
#define I2C_STOP2                     173
#define I2C_DAT2                      174
#define DATA_ADDRESS2                 175
#define SSP2STAT_D_NOT_A              176
#define D_A2                          177
#define SSP2STAT_D_nA                 178
#define nA2                           179
#define DA2                           180
#define nADDRESS2                     181
#define D_nA2                         182
#define SSP2STAT_CKE                  183
#define CKE2                          184
#define SSP2STAT_SMP                  185
#define SMP2                          186
#define SSP2ADD                       187
#define SSP2ADD_SSPADD                188
#define MSK02                         189
#define SSP2ADD_MSK0                  190
#define MSK12                         191
#define SSP2ADD_MSK1                  192
#define MSK22                         193
#define SSP2ADD_MSK2                  194
#define MSK32                         195
#define SSP2ADD_MSK3                  196
#define MSK42                         197
#define SSP2ADD_MSK4                  198
#define MSK52                         199
#define SSP2ADD_MSK5                  200
#define MSK62                         201
#define SSP2ADD_MSK6                  202
#define MSK72                         203
#define SSP2ADD_MSK7                  204
#define SSP2BUF                       205
#define SSP2BUF_SSPBUF                206
#define T4CON                         207
#define T4CKPS0                       208
#define T4CKPS                        209
#define T4CKPS1                       210
#define TMR4ON                        211
#define T4OUTPS                       212
#define T4OUTPS0                      213
#define T4OUTPS1                      214
#define T4OUTPS2                      215
#define T4OUTPS3                      216
#define PR4                           217
#define TMR4                          218
#define T3CON                         219
#define TMR3ON                        220
#define T3CON_RD16                    221
#define T3SYNC                        222
#define T3CKPS0                       223
#define T3CKPS                        224
#define T3CKPS1                       225
#define TMR3CS                        226
#define TMR3CS0                       227
#define TMR3CS1                       228
#define T3RD16                        229
#define RD163                         230
#define TMR3L                         231
#define TMR3H                         232
#define BAUDCON2                      233
#define ABDEN2                        234
#define BAUDCON2_ABDEN                235
#define WUE2                          236
#define BAUDCON2_WUE                  237
#define BRG162                        238
#define BAUDCON2_BRG16                239
#define SCKP2                         240
#define TXCKP2                        241
#define BAUDCON2_TXCKP                242
#define DTRXP2                        243
#define RXDTP2                        244
#define BAUDCON2_RXDTP                245
#define RCMT2                         246
#define RCIDL2                        247
#define BAUDCON2_RCIDL                248
#define BAUDCON2_ABDOVF               249
#define ABDOVF2                       250
#define SPBRGH2                       251
#define BAUDCON1                      252
#define BAUDCON1_ABDEN                253
#define ABDEN1                        254
#define BAUDCON1_WUE                  255
#define WUE1                          256
#define W4E                           257
#define BRG161                        258
#define BAUDCON1_BRG16                259
#define CKTXP                         260
#define BAUDCON1_TXCKP                261
#define SCKP1                         262
#define TXCKP1                        263
#define SCKP                          264
#define DTRXP1                        265
#define RXDTP1                        266
#define DTRXP                         267
#define RXCKP                         268
#define BAUDCON1_RXDTP                269
#define RCMT1                         270
#define RCIDL1                        271
#define BAUDCON1_RCIDL                272
#define RCMT                          273
#define ABDOVF1                       274
#define BAUDCON1_ABDOVF               275
#define SPBRGH1                       276
#define PORTA                         277
#define C1INA                         278
#define AN0                           279
#define ULPWUIN                       280
#define ULPWU                         281
#define RP0                           282
#define RA0                           283
#define AN1                           284
#define RP1                           285
#define RA1                           286
#define C2INA                         287
#define CVREF_MINUS                   288
#define AN2                           289
#define RA2                           290
#define VREF_MINUS                    291
#define C2INB                         292
#define C1INB                         293
#define AN3                           294
#define VREF_PLUS                     295
#define RA3                           296
#define AN4                           297
#define LVDIN                         298
#define NOT_SS1                       299
#define RP2                           300
#define RA5                           301
#define nSS1                          302
#define HLVDIN                        303
#define CLKO                          304
#define RA6                           305
#define OSC2                          306
#define CLKI                          307
#define RJPU                          308
#define RA7                           309
#define OSC1                          310
#define PORTB                         311
#define RB0                           312
#define INT0                          313
#define RP3                           314
#define AN12                          315
#define RB1                           316
#define RP4                           317
#define RTCC                          318
#define AN10                          319
#define REFO                          320
#define RP5                           321
#define AN8                           322
#define RB2                           323
#define CTEDG1                        324
#define RP6                           325
#define AN9                           326
#define RB3                           327
#define CCP2_PA2                      328
#define CTEDG2                        329
#define RB4                           330
#define RP7                           331
#define KBI0                          332
#define RB5                           333
#define RP8                           334
#define KBI1                          335
#define PGC                           336
#define RB6                           337
#define RP9                           338
#define KBI2                          339
#define PGD                           340
#define RB7                           341
#define RP10                          342
#define KBI3                          343
#define PORTC                         344
#define T1CKI                         345
#define RP11                          346
#define T1OSO                         347
#define RC0                           348
#define CCP2                          349
#define RP12                          350
#define T1OSI                         351
#define PA2                           352
#define RC1                           353
#define CTPLS                         354
#define RP13                          355
#define PA1                           356
#define RC2                           357
#define AN11                          358
#define SCK1                          359
#define SCL1                          360
#define RP14                          361
#define RC3                           362
#define SDI1                          363
#define RP15                          364
#define RC4                           365
#define RP16                          366
#define SDO1                          367
#define RC5                           368
#define RP17                          369
#define TX1                           370
#define RC6                           371
#define CK1                           372
#define RP18                          373
#define RX1                           374
#define RC7                           375
#define DT1                           376
#define HLVDCON                       377
#define HLVDL                         378
#define HLVDL0                        379
#define HLVDL1                        380
#define HLVDL2                        381
#define HLVDL3                        382
#define HLVDEN                        383
#define IRVST                         384
#define BGVST                         385
#define VDIRMAG                       386
#define DMACON2                       387
#define INTLVL0                       388
#define INTLVL                        389
#define INTLVL1                       390
#define INTLVL2                       391
#define INTLVL3                       392
#define DLYCYC                        393
#define DLYCYC0                       394
#define DLYCYC1                       395
#define DLYCYC2                       396
#define DLYCYC3                       397
#define DMACON1                       398
#define DMAEN                         399
#define DLYINTEN                      400
#define DUPLEX0                       401
#define DUPLEX1                       402
#define RXINC                         403
#define TXINC                         404
#define SSCON0                        405
#define SSCON1                        406
#define LATA                          407
#define LATA0                         408
#define LA0                           409
#define LATA1                         410
#define LA1                           411
#define LATA2                         412
#define LA2                           413
#define LATA3                         414
#define LA3                           415
#define LATA5                         416
#define LA5                           417
#define LATA6                         418
#define LA6                           419
#define LATA7                         420
#define LA7                           421
#define LATB                          422
#define LB0                           423
#define LATB0                         424
#define LB1                           425
#define LATB1                         426
#define LB2                           427
#define LATB2                         428
#define LB3                           429
#define LATB3                         430
#define LB4                           431
#define LATB4                         432
#define LB5                           433
#define LATB5                         434
#define LB6                           435
#define LATB6                         436
#define LB7                           437
#define LATB7                         438
#define LATC                          439
#define LATC0                         440
#define LC0                           441
#define LATC1                         442
#define LC1                           443
#define LATC2                         444
#define LC2                           445
#define LATC3                         446
#define LC3                           447
#define LATC4                         448
#define LC4                           449
#define LATC5                         450
#define LC5                           451
#define LATC6                         452
#define LC6                           453
#define LATC7                         454
#define LC7                           455
#define ALRMVALL                      456
#define ALRMVALH                      457
#define ALRMRPT                       458
#define ARPT0                         459
#define ARPT                          460
#define ARPT1                         461
#define ARPT2                         462
#define ARPT3                         463
#define ARPT4                         464
#define ARPT5                         465
#define ARPT6                         466
#define ARPT7                         467
#define ALRMCFG                       468
#define ALRMPTR                       469
#define ALRMPTR0                      470
#define ALRMPTR1                      471
#define AMASK0                        472
#define AMASK                         473
#define AMASK1                        474
#define AMASK2                        475
#define AMASK3                        476
#define CHIME                         477
#define ALRMEN                        478
#define TRISA                         479
#define TRISA0                        480
#define TRISA1                        481
#define TRISA2                        482
#define TRISA3                        483
#define TRISA5                        484
#define TRISA6                        485
#define TRISA7                        486
#define TRISB                         487
#define TRISB0                        488
#define TRISB1                        489
#define TRISB2                        490
#define TRISB3                        491
#define TRISB4                        492
#define TRISB5                        493
#define TRISB6                        494
#define TRISB7                        495
#define TRISC                         496
#define TRISC0                        497
#define TRISC1                        498
#define TRISC2                        499
#define TRISC3                        500
#define TRISC4                        501
#define TRISC5                        502
#define TRISC6                        503
#define TRISC7                        504
#define T3GCON                        505
#define T3GSS0                        506
#define T3GSS1                        507
#define T3GVAL                        508
#define T3GGO                         509
#define T3DONE                        510
#define T3GGO_T3DONE                  511
#define T3GSPM                        512
#define T3GTM                         513
#define T3GPOL                        514
#define TMR3GE                        515
#define RTCVALL                       516
#define WAITE0                        517
#define RTCVALH                       518
#define WAITE1                        519
#define WAITM0                        520
#define WAITM1                        521
