tiborsimon/embedded-tdd-headers/pic/pic18/pic18lf26j11_tdd.h
#define NOT_CM                        1091
#define CM                            1092
#define nCM                           1093
#define IPEN                          1094
#define CM2CON                        1095
#define CM2CON_CCH                    1096
#define CM2CON_CCH0                   1097
#define CCH02                         1098
#define CCH12                         1099
#define CM2CON_CCH1                   1100
#define CM2CON_CREF                   1101
#define CREF2                         1102
#define CM2CON_EVPOL                  1103
#define EVPOL02                       1104
#define CM2CON_EVPOL0                 1105
#define EVPOL12                       1106
#define CM2CON_EVPOL1                 1107
#define CM2CON_CPOL                   1108
#define CPOL2                         1109
#define CM2CON_COE                    1110
#define COE2                          1111
#define CM2CON_CON                    1112
#define CON2                          1113
#define CM1CON                        1114
#define CM1CON_CCH                    1115
#define C1CH0                         1116
#define CM1CON_CCH0                   1117
#define CCH01                         1118
#define CCH11                         1119
#define C1CH1                         1120
#define CM1CON_CCH1                   1121
#define CM1CON_CREF                   1122
#define CREF1                         1123
#define EVPOL01                       1124
#define CM1CON_EVPOL0                 1125
#define CM1CON_EVPOL                  1126
#define CM1CON_EVPOL1                 1127
#define EVPOL11                       1128
#define CM1CON_CPOL                   1129
#define CPOL1                         1130
#define CM1CON_COE                    1131
#define COE1                          1132
#define CM1CON_CON                    1133
#define CON1                          1134
#define OSCCON                        1135
#define SCS0                          1136
#define SCS                           1137
#define SCS1                          1138
#define OSTS                          1139
#define IRCF                          1140
#define IRCF0                         1141
#define IRCF1                         1142
#define IRCF2                         1143
#define IDLEN                         1144
#define T0CON                         1145
#define T0PS                          1146
#define T0PS0                         1147
#define T0PS1                         1148
#define T0PS2                         1149
#define PSA                           1150
#define T0SE                          1151
#define T0CS                          1152
#define T08BIT                        1153
#define TMR0ON                        1154
#define TMR0L                         1155
#define TMR0H                         1156
#define STATUS                        1157
#define C                             1158
#define CARRY                         1159
#define DC                            1160
#define ZERO                          1161
#define Z                             1162
#define OV                            1163
#define OVERFLOW                      1164
#define N                             1165
#define NEGATIVE                      1166
#define FSR2L                         1167
#define PLUSW2                        1168
#define PREINC2                       1169
#define POSTDEC2                      1170
#define POSTINC2                      1171
#define INDF2                         1172
#define FSR1L                         1173
#define PLUSW1                        1174
#define PREINC1                       1175
#define POSTDEC1                      1176
#define POSTINC1                      1177
#define INDF1                         1178
#define WREG                          1179
#define FSR0L                         1180
#define PLUSW0                        1181
#define PREINC0                       1182
#define POSTDEC0                      1183
#define POSTINC0                      1184
#define INDF0                         1185
#define INTCON3                       1186
#define INT1IF                        1187
#define INT1F                         1188
#define INT2IF                        1189
#define INT2F                         1190
#define INT3F                         1191
#define INT3IF                        1192
#define INT1E                         1193
#define INT1IE                        1194
#define INT2IE                        1195
#define INT2E                         1196
#define INT3E                         1197
#define INT3IE                        1198
#define INT1P                         1199
#define INT1IP                        1200
#define INT2IP                        1201
#define INT2P                         1202
#define INTCON2                       1203
#define RBIP                          1204
#define INT3IP                        1205
#define INT3P                         1206
#define TMR0IP                        1207
#define T0IP                          1208
#define INTEDG3                       1209
#define INTEDG2                       1210
#define INTEDG1                       1211
#define INTEDG0                       1212
#define RBPU                          1213
#define NOT_RBPU                      1214
#define nRBPU                         1215
#define INTCON                        1216
#define RBIF                          1217
#define INT0F                         1218
#define INT0IF                        1219
#define T0IF                          1220
#define TMR0IF                        1221
#define RBIE                          1222
#define INT0E                         1223
#define INT0IE                        1224
#define T0IE                          1225
#define TMR0IE                        1226
#define PEIE                          1227
#define PEIE_GIEL                     1228
#define GIEL                          1229
#define GIE_GIEH                      1230
#define GIE                           1231
#define GIEH                          1232
#define PRODL                         1233
#define PRODH                         1234
#define TABLAT                        1235
#define TBLPTRL                       1236
#define TBLPTRH                       1237
#define PCL                           1238
#define PCLATH                        1239
#define PCH                           1240
#define SP0                           1241
#define STKPTR                        1242
#define SP1                           1243
#define SP2                           1244
#define SP3                           1245
#define SP4                           1246
#define STKUNF                        1247
#define STKOVF                        1248
#define STKFUL                        1249
#define TOSL                          1250
#define TOSH                          1251

#endif // _PIC18LF26J11_H_
